Job

<?xml version="1.0" encoding="UTF-8"?>
    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <soapenv:Header>
    <fueloauth>{{accessToken}}</fueloauth>
  </soapenv:Header>
   <soapenv:Body>
    <CreateRequest xmlns="http://exacttarget.com/wsdl/partnerAPI">
        <Options/>
        <Objects xsi:type="ns2:DataExtension" xmlns:ns2="http://exacttarget.com/wsdl/partnerAPI">
            <CustomerKey>Job Data View</CustomerKey>
            <Name>Job Data View</Name>
            <Description>Mimics the Job Data View</Description>
            <IsSendable>false</IsSendable>
            <IsTestable>false</IsTestable>
            <Fields>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>JobID</CustomerKey>
                    <Name>JobID</Name>
                    <Label>JobID</Label>
                    <IsRequired>true</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Number</FieldType>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>EmailID</CustomerKey>
                    <Name>EmailID</Name>
                    <Label>EmailID</Label>
                    <IsRequired>false</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Number</FieldType>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>AccountID</CustomerKey>
                    <Name>AccountID</Name>
                    <Label>AccountID</Label>
                    <IsRequired>false</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Number</FieldType>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>AccountUserID</CustomerKey>
                    <Name>AccountUserID</Name>
                    <Label>AccountUserID</Label>
                    <IsRequired>false</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Number</FieldType>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>FromName</CustomerKey>
                    <Name>FromName</Name>
                    <Label>FromName</Label>
                    <IsRequired>false</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Text</FieldType>
                    <MaxLength>130</MaxLength>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>FromEmail</CustomerKey>
                    <Name>FromEmail</Name>
                    <Label>FromEmail</Label>
                    <IsRequired>false</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Text</FieldType>
                    <MaxLength>100</MaxLength>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>SchedTime</CustomerKey>
                    <Name>SchedTime</Name>
                    <Label>SchedTime</Label>
                    <IsRequired>false</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Date</FieldType>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>PickupTime</CustomerKey>
                    <Name>PickupTime</Name>
                    <Label>PickupTime</Label>
                    <IsRequired>false</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Date</FieldType>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>DeliveredTime</CustomerKey>
                    <Name>DeliveredTime</Name>
                    <Label>DeliveredTime</Label>
                    <IsRequired>false</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Date</FieldType>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>EventID</CustomerKey>
                    <Name>EventID</Name>
                    <Label>EventID</Label>
                    <IsRequired>false</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Text</FieldType>
                    <MaxLength>50</MaxLength>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>IsMultipart</CustomerKey>
                    <Name>IsMultipart</Name>
                    <Label>IsMultipart</Label>
                    <IsRequired>true</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Boolean</FieldType>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>JobType</CustomerKey>
                    <Name>JobType</Name>
                    <Label>JobType</Label>
                    <IsRequired>false</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Text</FieldType>
                    <MaxLength>50</MaxLength>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>JobStatus</CustomerKey>
                    <Name>JobStatus</Name>
                    <Label>JobStatus</Label>
                    <IsRequired>false</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Text</FieldType>
                    <MaxLength>50</MaxLength>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>ModifiedBy</CustomerKey>
                    <Name>ModifiedBy</Name>
                    <Label>ModifiedBy</Label>
                    <IsRequired>false</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Number</FieldType>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>ModifiedDate</CustomerKey>
                    <Name>ModifiedDate</Name>
                    <Label>ModifiedDate</Label>
                    <IsRequired>false</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Date</FieldType>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>EmailName</CustomerKey>
                    <Name>EmailName</Name>
                    <Label>EmailName</Label>
                    <IsRequired>false</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Text</FieldType>
                    <MaxLength>100</MaxLength>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>EmailSubject</CustomerKey>
                    <Name>EmailSubject</Name>
                    <Label>EmailSubject</Label>
                    <IsRequired>false</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Text</FieldType>
                    <MaxLength>200</MaxLength>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>IsWrapped</CustomerKey>
                    <Name>IsWrapped</Name>
                    <Label>IsWrapped</Label>
                    <IsRequired>true</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Boolean</FieldType>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>TestEmailAddr</CustomerKey>
                    <Name>TestEmailAddr</Name>
                    <Label>TestEmailAddr</Label>
                    <IsRequired>false</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Text</FieldType>
                    <MaxLength>128</MaxLength>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>Category</CustomerKey>
                    <Name>Category</Name>
                    <Label>Category</Label>
                    <IsRequired>true</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Text</FieldType>
                    <MaxLength>100</MaxLength>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>BccEmail</CustomerKey>
                    <Name>BccEmail</Name>
                    <Label>BccEmail</Label>
                    <IsRequired>false</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Text</FieldType>
                    <MaxLength>100</MaxLength>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>OriginalSchedTime</CustomerKey>
                    <Name>OriginalSchedTime</Name>
                    <Label>OriginalSchedTime</Label>
                    <IsRequired>false</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Date</FieldType>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>CreatedDate</CustomerKey>
                    <Name>CreatedDate</Name>
                    <Label>CreatedDate</Label>
                    <IsRequired>true</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Date</FieldType>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>CharacterSet</CustomerKey>
                    <Name>CharacterSet</Name>
                    <Label>CharacterSet</Label>
                    <IsRequired>false</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Text</FieldType>
                    <MaxLength>30</MaxLength>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>IPAddress</CustomerKey>
                    <Name>IPAddress</Name>
                    <Label>IPAddress</Label>
                    <IsRequired>false</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Text</FieldType>
                    <MaxLength>50</MaxLength>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>SalesForceTotalSubscriberCount</CustomerKey>
                    <Name>SalesForceTotalSubscriberCount</Name>
                    <Label>SalesForceTotalSubscriberCount</Label>
                    <IsRequired>true</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Number</FieldType>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>SalesForceErrorSubscriberCount</CustomerKey>
                    <Name>SalesForceErrorSubscriberCount</Name>
                    <Label>SalesForceErrorSubscriberCount</Label>
                    <IsRequired>true</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Number</FieldType>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>SendType</CustomerKey>
                    <Name>SendType</Name>
                    <Label>SendType</Label>
                    <IsRequired>true</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Text</FieldType>
                    <MaxLength>128</MaxLength>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>DynamicEmailSubject</CustomerKey>
                    <Name>DynamicEmailSubject</Name>
                    <Label>DynamicEmailSubject</Label>
                    <IsRequired>false</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Text</FieldType>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>SuppressTracking</CustomerKey>
                    <Name>SuppressTracking</Name>
                    <Label>SuppressTracking</Label>
                    <IsRequired>true</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Boolean</FieldType>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>SendClassificationType</CustomerKey>
                    <Name>SendClassificationType</Name>
                    <Label>SendClassificationType</Label>
                    <IsRequired>false</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Text</FieldType>
                    <MaxLength>32</MaxLength>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>SendClassification</CustomerKey>
                    <Name>SendClassification</Name>
                    <Label>SendClassification</Label>
                    <IsRequired>false</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Text</FieldType>
                    <MaxLength>36</MaxLength>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>ResolveLinksWithCurrentData</CustomerKey>
                    <Name>ResolveLinksWithCurrentData</Name>
                    <Label>ResolveLinksWithCurrentData</Label>
                    <IsRequired>true</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Boolean</FieldType>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>EmailSendDefinition</CustomerKey>
                    <Name>EmailSendDefinition</Name>
                    <Label>EmailSendDefinition</Label>
                    <IsRequired>false</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Text</FieldType>
                    <MaxLength>36</MaxLength>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>DeduplicateByEmail</CustomerKey>
                    <Name>DeduplicateByEmail</Name>
                    <Label>DeduplicateByEmail</Label>
                    <IsRequired>true</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Boolean</FieldType>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>TriggererSendDefinitionObjectID</CustomerKey>
                    <Name>TriggererSendDefinitionObjectID</Name>
                    <Label>TriggererSendDefinitionObjectID</Label>
                    <IsRequired>false</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Text</FieldType>
                    <MaxLength>36</MaxLength>
                </Field>
                <Field xsi:type="ns2:DataExtensionField">
                    <CustomerKey>TriggeredSendCustomerKey</CustomerKey>
                    <Name>TriggeredSendCustomerKey</Name>
                    <Label>TriggeredSendCustomerKey</Label>
                    <IsRequired>false</IsRequired>
                    <IsPrimaryKey>false</IsPrimaryKey>
                    <FieldType>Text</FieldType>
                    <MaxLength>36</MaxLength>
                </Field>
            </Fields>
        </Objects>
    </CreateRequest>
</soapenv:Body>
</soapenv:Envelope>
